//*رد بوت ساسكي تبع ايتاتشي
// معلش ي ايتاتشي كسلت اعمل واحده 😀
// اعمل واحده بس احط رد تل

let handler = m => m; 
 handler.all = async function (m) { 

   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^هلا|اهلا$/i.test(m.text)) { 
     responses = [ 
 '*هلا بيك يقلبي ✨👀*'  
     ]; 
} else if (/^السلام عليكم|سلام عليكم ورحمه الله وبركاته|سلام عليكم|السلام عليكم ورحمه الله وبركاته$/i.test(m.text)) { 
     responses = [ 
       '*♥🐥وعليكم السلام*',  
     ]; 
   }else if (/^عفرتو|بلاك$/i.test(m.text)) { 
     responses = [ 
'*بوت بلاك و عفرتو تحت امرك*'
     ]; 
 }else if (/^عامل اى| عامل ايه$/i.test(m.text)) { 
     responses = [ 
'*بخير الحمد لله و انت/ى كيفك ✨❤️*'
     ]; 
   }else if (/^كسمك|يا أبن العاهرة|يا أبن وسخه|خول|يا خول|هنيكك|يا عرص|عرص|يا أبن شرموطه|امك شرموطه|يا أبن المتناكه|لف|امك كانت معايا|اختك شرموطه$/i.test(m.text)) { 
     responses = [ 
'* عيب هتطلع برا زى كلب مقامك تحت رجلى*'
   ]; 
   }else if (/^بتحبنى|بوت بتحبنى$/i.test(m.text)) { 
     responses = [ 
'*اموت فيكى 🌚💔*',
'*اايوه 😉*',
'*احبك نص حب 🙃💔*',
]; 
   }else if (/^بتكرهنى$/i.test(m.text)) { 
     responses = [ 
'*ماعاش من يكرهكك حبي 🙁*',
'*لا بس مش تزعل نفسك لحبك🫥*',
'*🙄مقدرش*',   ]; 
     
     }else if (/^هاي|هالو$/i.test(m.text)) { 
     responses = [ 
       '*هالو🌚♥*',  

     ]; 
}else if (/^بحبك/i.test(m.text)) { 
     responses = [ 
       '*بحبك اكتر🌚❤*',  

     ]; 
   }else if (/^ڤينوم من وين انت؟$/i.test(m.text)) { 
     responses = [ 
'❤🇪🇬مصر'
     ]; 
   } else if (/^احبك$/i.test(m.text)) { 
     responses = [ 
'*مـي تو 🙂🫀*'
     ]; 
     }else if (/^عامل ايه|عامل اي|عامل اية$/i.test(m.text)) { 
     responses = [ 
       'الحمدالله',  

     ];
     }else if (/^تحبني$/i.test(m.text)) { 
     responses = [ 
       '🌚♥اكيد',  

     ];
     }else if (/^هاي$/i.test(m.text)) { 
     responses = [ 
       'هاي',  

     ];
     }else if (/^❤|♥$/i.test(m.text)) { 
     responses = [ 
       '*اعشقق♥*',  

     ];
     }else if (/^اهلا$/i.test(m.text)) { 
     responses = [ 
       '*اهلا♥*',  

     ]; 
     }else if (/^مساء|مساء$/i.test(m.text)) { 
     responses = [ 
       'مساء الخير',  

     ];
     }else if (/^صباح|صباح$/ .test(m.text)) { 
     responses = [ 
       '*صباح الورد♥*',  
     ];
       }else if (/^اوامر$/i.test(m.text)) { 
     responses = [ 
       '*لا تنسى ال .*',  
     ];
            }else if (/^venom$/i.test(m.text)) { 
     responses = [ 
       '*تحت امرك حبي*',  
     ];
            }else if (/^مرحبا$/i.test(m.text)) { 
     responses = [ 
       '*مرحبا♥*',  
     ];
   }
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 

 export default handler;
